var local_database = [
    {
    x: 108.88137,
    y: 34.28416,
    title: "唐长安城光化门",
    time: "公元626年",
    contentText: "光化门既是唐长安城北外郭城的最西门，也是禁苑的西南门。唐中宗时，身为临淄王的李隆基曾在这里与吐蕃使者打过一场马球友谊赛。有关光化门的位置和形式，考古工作者始终没有探明。不过，从火烧碑村老人所讲的有关“狐仙洞”的传说中，似乎还能找到有关光化门遗址的蛛丝马迹。"
},
{
    x: 108.87116,
    y: 34.27487,
    title: "唐长安城修真坊",
    time: "公元626年",
    contentText: "光化门西的修真坊内，有汉代的灵台遗址。汉代的灵台，是当时的天文气象观察台。",
},
{
    x: 108.88172,
    y: 34.29849,
    title: "汉长安城未央宫",
    time: "公元前202年",
    contentText: "西汉帝国200余年间的政令中心，西汉以后，仍是多个朝代的理政之地，隋唐时也被划为禁苑的一部分。",
},
{
    x: 108.89725,
    y: 34.28409,
    title: "唐长安城景耀门",
    time: "公元626年",
    contentText: "唐代时，滋润了长安城西的永安渠从景曜门东流入禁苑。景曜门也写作景耀门。是唐长安城郭城北门中间门，唐代在隋大兴城光化、华林门（唐代芳林门）基础上，新开此门。“曜”字读耀音，意为日光、光芒、明亮的意思，而景也有阳光太阳的意思，所以景曜门因意为光明之门。",
},
{
    x: 108.88944,
    y: 34.27353,
    title: "唐长安城安定坊",
    time: "公元626年",
    contentText: "安定坊内曾居住过章怀太子李贤。章怀太子李贤是唐高宗李治和武则天的次子。",
},
{
    x: 108.90867,
    y: 34.27757,
    title: "唐长安修德坊",
    time: "公元626年",
    contentText: "修德坊内有一寺：弘福寺。高僧玄奘取经归来后，曾在门内宏福寺翻译经文。后人熟悉的《大唐西域记》就出自弘福寺内。\n 贞观疑案：一日，负责京城治安的巡城御史接到报案，有人在西市的当铺典当怀疑是皇家的宝物。御史查核后证实，这只镶金嵌玉的金宝神枕的确是宫廷之宝，于是立即将疑犯缉拿归案。\n经审讯，小偷供认，金宝神枕是从会昌寺辩机和尚的禅房偷来的，御史大夫立即派衙役到弘福寺译场传召辩机作证。辩机坦然承认，这只玉枕是高阳公主所赐。御史觉得事关重大，于是又传召梁国公府的侍婢作供，得知高阳公主下嫁给梁国公房玄龄的次子房遗爱之后，曾与僧人辩机私通，施赠财宝数以亿计，更以二女子侍房遗爱。御史大夫立即将此案奏表朝廷，请太宗定夺。\n太极殿上，太宗闻奏大怒。 一个出家僧人竟与当朝公主私通！我大唐的国体何在！太宗立即责令刑部缉拿辩机归案，处以腰斩极刑，以儆效尤，甚至连高阳公主身边知情不报的侍婢也要统统处死。",
},
{
    x: 108.92257,
    y: 34.28558,
    title: "唐长安城芳林门",
    time: "公元626年",
    contentText: "安定坊内曾居住过章怀太子李贤。章怀太子李贤是唐高宗李治和武则天的次子。",
},
{
    x: 108.90970,
    y: 34.29317,
    title: "唐长安城梨园",
    time: "公元626年",
    contentText: "唐朝期间歌舞艺人聚集的地方，也是世界上最早的歌舞艺人学校培训基地",
},
{
    x: 108.90970,
    y: 34.29317,
    title: "唐长安城梨园",
    time: "公元626年",
    contentText: "唐朝期间歌舞艺人聚集的地方，也是世界上最早的歌舞艺人学校培训基地",
},
{
    x: 108.93115,
    y: 34.29324,
    title: "唐长安城玄武门",
    time: "公元626年",
    contentText: "唐代皇宫城墙各门都由宫廷卫军把守，而玄武门外就设有两廊，宫廷卫军指挥部驻在这里，有坚固的工事和雄厚的兵力。因此，政变发生时首先控制玄武门就很重要，控制了玄武门便可以控制内廷，控制了内廷也就可以控制皇帝，从而控制国家。",
},
{
    x: 108.93115,
    y: 34.29324,
    title: "唐长安城玄武门",
    time: "公元626年",
    contentText: "唐代皇宫城墙各门都由宫廷卫军把守，而玄武门外就设有两廊，宫廷卫军指挥部驻在这里，有坚固的工事和雄厚的兵力。因此，政变发生时首先控制玄武门就很重要，控制了玄武门便可以控制内廷，控制了内廷也就可以控制皇帝，从而控制国家。",
},
]

module.exports = {
    postlist: local_database
}